In [1]:
import numpy as np
import pandas as pd

# 读取文件 ★
—— pd.read_csv('文件名') 读取csv文件 或 txt文件

—— pd.read_excel('文件名') 读取excel文件

    sep 间隔类型，不指定时默认为 ,
    header 第一行。等于None时，将其视为普通元素加入第一行
    names 赋予columns
    导入的是dataFrame类型
—— pd.concat([df1,df2], axis=0)   合并两个DataFrame；axis=0，故纵向叠加

In [3]:
data = pd.read_csv('data1.csv')   #index默认为0，1，2进行填充
print(type(data))
data

<class 'pandas.core.frame.DataFrame'>

    name  age    sex
0    joe   18    men
1  susan   19    NaN
2   anne   20  women

In [3]:
data2 = pd.read_csv('data1.csv',header =None)
data2

       0    1      2
0   name  age    sex
1    joe   18    men
2  susan   19    NaN
3   anne   20  women

In [4]:
data3 = pd.read_csv('data3.txt',sep = ';')
data3

    name  age    sex
0    joe   18    men
1  susan   19  women
2   anne   20  women

# 获取数据

In [5]:
data4 = pd.read_excel('data2.xlsx')
data4['语文'] = [70,82.5,90]
data4['数学'] = [72,83.5,88]
data4['英语'] = [72,50,88]
data4

    name  age    sex    语文    数学  英语
0    joe   18    men  70.0  72.0  72
1  susan   19  women  82.5  83.5  50
2   anne   20  women  90.0  88.0  88

In [6]:
data4 = data4[data4.columns[3:]]   #columns[] 获取列数据  不能用columns['语文':]
data4

     语文    数学  英语
0  70.0  72.0  72
1  82.5  83.5  50
2  90.0  88.0  88

##### 1、去重 ★
—— *.unique() 为Series去重 ；DataFrame使用时需要指定列名

In [7]:
ser01 = pd.Series(['a','b','c','a','b','c','a'])
print(ser01.unique())

['a' 'b' 'c']

In [3]:
df = pd.DataFrame({
    'order_id':['1001','1002','1003','1004','1005','1006'],
    'member_id':['a01','a02','a03','a01','a02','a03'],
    'order_amt':[80,90,70,79,88,90],
})
print(df)
print()
print('下单用户：')
print(df['member_id'].unique())  #输出某列的不重复值—— DataFrame没有unique属性

  member_id  order_amt order_id
0       a01         80     1001
1       a02         90     1002
2       a03         70     1003
3       a01         79     1004
4       a02         88     1005
5       a03         90     1006

下单用户：
['a01' 'a02' 'a03']

##### 2、查数 ★
—— *.value_counts() 统计Series中的元素出现次数，DataFrame使用时需要指定列名

    ascending = True ：按ASC顺序排序

In [9]:
ser01 = pd.Series(['a','b','c','a','b','c','a'])
print(ser01.value_counts(ascending = True))

b    2
c    2
a    3
dtype: int64

In [10]:
df = pd.DataFrame({
    'order_id':['1001','1002','1003','1004','1005','1006'],
    'member_id':['a01','a02','a03','a01','a02','a03'],
    'order_amt':[80,90,70,79,88,90],
})
print(df)
print()
df['member_id'].value_counts()

  order_id member_id  order_amt
0     1001       a01         80
1     1002       a02         90
2     1003       a03         70
3     1004       a01         79
4     1005       a02         88
5     1006       a03         90

a01    2
a03    2
a02    2
Name: member_id, dtype: int64

# 缺失值处理 ★

##### 1、删除法
—— .dropna() 默认删除存在NaN的行

    how = 'any' 为默认处理方式，只要有一个数据为NaN，就将该行删除操作 ；how=’all’只滤除全为NaN的行
    axis = 0 为默认，删除存在NaN的行；当axis = 1时，删除存在NaN的列
    np.NaN 为人为添加的NaN

In [16]:
dict01 = {
    'name':['joe','susan','black'],
    'age':[19,19,20],
    'sex':['men','women',np.NaN],
    'classid':1
}
df01 = pd.DataFrame(dict01,index = ['one','two','three'])
print(df01)

# df1.dropna()
# df01.dropna(how = 'any')
df01.dropna(axis = 0)

       age  classid   name    sex
one     19        1    joe    men
two     19        1  susan  women
three   20        1  black    NaN

     age  classid   name    sex
one   19        1    joe    men
two   19        1  susan  women

##### 2、替换法
—— *.fillna(x) 用x替换NaN值

    method = 'ffill' 向下填充，依据上方数据，复制下拉填充。类似于excel的下拉式填充
    method = 'bfill' 向上填充 —— 依据下方数据，复试上拉填充
    x为字典时，key是columns值，用Value值替换NaN
    
—— *.replace(x,y) 用y替换x。x如果是np.nan则和.fillna功能一样

In [19]:
dict02 = {
    'name':['joe','susan','black'],
    'age':[19,19,20],
    'sex':['men','women',np.NaN],
    'classid':1
}
df02 = pd.DataFrame(dict02,index = ['one','two','three'])

df02.loc[1:2,'sex'] = np.NaN   # 写作np.nan也是一样的
df02.loc[1:2,'classid'] = np.NaN
df02

       age  classid   name  sex
one     19      1.0    joe  men
two     19      NaN  susan  NaN
three   20      1.0  black  NaN

In [21]:
# df03 = df02.fillna(0)   # 使用0填充NaN数据
# df03 = df02.replace(np.nan,0)

df03 = df02.fillna(method = 'ffill')
# df03 = df02.fillna(method = 'bfill')
# df03 = df02.fillna({'sex':25,'classid':50})
df03

       age  classid   name  sex
one     19      1.0    joe  men
two     19      1.0  susan  men
three   20      1.0  black  men

# 成员资格

—— *.isin( [ ] ) 判断数据是否存在于Series或DataFrame中 ；一定要用list类型

—— ~DataF.isin(['b','c'])  ~ bool假运算

In [23]:
ser01 = pd.Series(['a','b','c','a','b','c','a'])
mask = ser01.isin(['b'])   #必须加[ ]，即list类型索引。   mask = ~ser01.isin(['b','c']) 包含b或c的为False
print(mask)
ser01[mask]   #进行bool筛选，返回索引和数据

0    False
1     True
2    False
3    False
4     True
5    False
6    False
dtype: bool

1    b
4    b
dtype: object

In [15]:
# 例题
df = pd.DataFrame({
    'order_id':['1001','1002','1003','1004','1005','1006'],
    'member_id':['a01','a02','a03','a01','a02','a03'],
    'order_amt':[80,90,70,79,88,90],
})
df

  order_id member_id  order_amt
0     1001       a01         80
1     1002       a02         90
2     1003       a03         70
3     1004       a01         79
4     1005       a02         88
5     1006       a03         90

In [16]:
mask = df.isin(['a01',80,'1001'])
mask

   order_id  member_id  order_amt
0      True       True       True
1     False      False      False
2     False      False      False
3     False       True      False
4     False      False      False
5     False      False      False

In [17]:
df[mask]   # DataFrame中的False的用NaN填充

  order_id member_id  order_amt
0     1001       a01       80.0
1      NaN       NaN        NaN
2      NaN       NaN        NaN
3      NaN       a01        NaN
4      NaN       NaN        NaN
5      NaN       NaN        NaN